;-----------------------
; ABILITIES
;-----------------------

[RepairKit_T1 X2AbilityTemplate]
LocFriendlyName="Repair"
LocLongDescription="Heal any damaged robotic ally for 4HP, neutralize acid, and repair all shredded armor."
LocHelpText="Heal a nearby damaged robotic ally."
LocFlyOverText="Repair"
LocPromotionPopupText="<Bullet/> The repair kit can be used to keep SPARKs in the fight.<br/><Bullet/> Repair will restore 4HP, remove any acid, and reset the target's armor to maximum.<br/>"

[RepairKit_T2 X2AbilityTemplate]
LocFriendlyName="Repair"
LocLongDescription="Heal any damaged robotic ally for 8HP, neutralize acid, and repair all shredded armor."
LocHelpText="Heal a nearby damaged robotic ally."
LocFlyOverText="Repair"
LocPromotionPopupText="<Bullet/> The repair kit can be used to keep SPARKs in the fight.<br/><Bullet/> Repair will restore 8HP, remove any acid, and reset the target's armor to maximum.<br/>"

[KineticStrike_Beagle X2AbilityTemplate]
LocFriendlyName="Kinetic Strike"
LocLongDescription="Attack any adjacent tile with a devastating punch. Damage is dependent on equipped chassis."
LocHelpText="Attack any adjacent tile with a devastating punch."
LocPromotionPopupText="<Bullet/> Kinetic Strike will do 6/8/10 damage, depending on the equipped SPARK chassis.<br/><Bullet/> Kinetic Strike's chance to hit an enemy is based off the SPARK's aim with a +10 boost.<br/><Bullet/> Learning the Assault Servos ability will grant +2 damage and an extra +20 aim to all Kinetic Strike attacks.<br/>"

[BrawlerProtocol_Beagle X2AbilityTemplate]
LocFriendlyName="Counterstrike"
LocLongDescription="The SPARK can throw free Strike attacks at any enemies who enter or attack from melee range. Does not require the Kinetic Strike ability."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Counterstrike"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will trigger if that enemy moves to another adjacent tile or tries to attack the SPARK.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Counterstrike will trigger when that enemy moves into melee range.<br/><Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will NOT trigger if that enemy moves directly away from the SPARK.<br/>"

[BrawlerTrigger_Beagle X2AbilityTemplate]
LocFriendlyName="Counterstrike"
LocLongDescription="The SPARK can throw free Strike attacks at any enemies who enter or attack from melee range. Does not require the Kinetic Strike ability."
LocHelpText="Free melee attacks on any enemies that enter or attack from melee range."
LocFlyOverText="Counterstrike"
LocPromotionPopupText="<Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will trigger if that enemy moves to another adjacent tile or tries to attack the SPARK.<br/><Bullet/> If an enemy does not begin their turn in an adjacent tile, then Counterstrike will trigger when that enemy moves into melee range.<br/><Bullet/> If an enemy begins their turn in an adjacent tile, Counterstrike will NOT trigger if that enemy moves directly away from the SPARK.<br/>"

;-----------------------
; ITEMS
;-----------------------

[RepairKit X2WeaponTemplate]
FriendlyName="Repair Kit"
FriendlyNamePlural="Repair Kits"
BriefSummary="A repair kit can be used to heal both the HP and armor of any damaged robotic unit. 2 charges." 
TacticalText="<Bullet/> A Repair Kit can restore HP to a single robotic ally.\n<Bullet/> A Repair Kit can also remove Acid effects and patch shredded Armor.\n"

[NanoRepairKit X2WeaponTemplate]
FriendlyName="Nanorepair Kit"
FriendlyNamePlural="Nanorepair Kits"
BriefSummary="A Nanorepair kit can be used to heal both the HP and armor of any damaged robotic unit. 2 charges." 
TacticalText="<Bullet/> A Repair Kit can restore HP to a single robotic ally.\n<Bullet/> A Repair Kit can also remove Acid effects and patch shredded Armor.\n"
